------------------------------------------------------------------------------------------------------------
      name:  STATA_Example2b
       log:  C:\Dropbox\19_PSQF7375_Clustered\PSQF7375_Clustered_Example2\STATA_Example2b_Output.log
  log type:  text
 opened on:   1 Aug 2019, 14:58:48

.         
. display as result "Eq 2.9: Adding Age by Grip Interaction"
Eq 2.9: Adding Age by Grip Interaction

. display as result "Age (0=85), Grip (0=9)"
Age (0=85), Grip (0=9)

. mixed cognition c.age85 c.grip9 c.sexmw c.demnf c.demnc c.age85#c.grip9, ///
>                   variance reml dfmethod(residual),

Computing degrees of freedom:

Mixed-effects REML regression                   Number of obs     =        550
DF method: Residual                             DF:           min =     543.00
                                                              avg =     543.00
                                                              max =     543.00

                                                F(6,   543.00)    =      36.85
Log restricted-likelihood = -2005.8468          Prob > F          =     0.0000

---------------------------------------------------------------------------------
      cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          age85 |  -.3339606   .1203566    -2.77   0.006    -.5703821   -.0975391
          grip9 |   .6194186   .1487424     4.16   0.000     .3272376    .9115996
          sexmw |  -3.455637   .8872749    -3.89   0.000    -5.198549   -1.712726
          demnf |  -5.922543   1.013632    -5.84   0.000    -7.913663   -3.931424
          demnc |   -16.3004   1.512547   -10.78   0.000    -19.27157   -13.32924
                |
c.age85#c.grip9 |   .1230185   .0405363     3.03   0.003     .0433914    .2026456
                |
          _cons |    29.4078   .6949062    42.32   0.000     28.04277    30.77284
---------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
               var(Residual) |    86.7615   5.231916      77.08994    97.64645
------------------------------------------------------------------------------

.       estat vce,  // Aymptotic covariance matrix of fixed effects for regions

Covariance matrix of coefficients of mixed model

             | cognition                                                                          
             |                                                                c.age85#            
        e(V) |      age85       grip9       sexmw       demnf       demnc     c.grip9       _cons 
-------------+------------------------------------------------------------------------------------
cognition    |                                                                                    
       age85 |   .0144857                                                                         
       grip9 |  .00331698    .0221243                                                             
       sexmw |    .005024   .05374269   .78725672                                                 
       demnf | -.00413095  -.01338766  -.07101552    1.027449                                     
       demnc | -.00115115  -.00030106   .02370811   .21291169   2.2877993                         
     c.age85#|                                                                                    
     c.grip9 |   .0009587   .00020294   .00269465  -.00267909    .0023964   .00164319             
       _cons |  .00045357  -.03075328  -.45067156  -.18202858  -.22634698   .00191647   .48289456 
-------------+------------------------------------------------------------------------------------
lnsig_e      |                                                                                    
       _cons |          0           0           0           0           0           0           0 

             | lnsig_e    
             |            
        e(V) |      _cons 
-------------+------------
lnsig_e      |            
       _cons |  .00090909 

.       predict predagegbyrip, xb         

.       corr cognition predagegbyrip  // model R2
(obs=550)

             | cognit~n predag~p
-------------+------------------
   cognition |   1.0000
predagegby~p |   0.5379   1.0000


.       display as result r(rho)^2
.28938225

.       lincom c.age85*1 + c.age85#c.grip9*-3, small  // Age Slope at Grip Strength =  6

 ( 1)  [cognition]age85 - 3*[cognition]c.age85#c.grip9 = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -.703016   .1533696    -4.58   0.000    -1.004286   -.4017456
------------------------------------------------------------------------------

.       lincom c.age85*1 + c.age85#c.grip9*0, small   // Age Slope at Grip Strength =  9

 ( 1)  [cognition]age85 = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.3339606   .1203566    -2.77   0.006    -.5703821   -.0975391
------------------------------------------------------------------------------

.       lincom c.age85*1 + c.age85#c.grip9*3, small   // Age Slope at Grip Strength = 12

 ( 1)  [cognition]age85 + 3*[cognition]c.age85#c.grip9 = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0350949   .1871539     0.19   0.851    -.3325394    .4027291
------------------------------------------------------------------------------

.       margins, at(c.grip9=(-3(3)3)) dydx(c.age85) df(543) vsquish // Age Slope per Grip

Average marginal effects                        Number of obs     =        550

Expression   : Linear prediction, fixed portion, predict()
dy/dx w.r.t. : age85
1._at        : grip9           =          -3
2._at        : grip9           =           0
3._at        : grip9           =           3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
age85        |
         _at |
          1  |   -.703016   .1533696    -4.58   0.000    -1.004286   -.4017456
          2  |  -.3339606   .1203566    -2.77   0.006    -.5703821   -.0975391
          3  |   .0350949   .1871539     0.19   0.851    -.3325394    .4027291
------------------------------------------------------------------------------

.       lincom c.grip9*1 + c.age85#c.grip9*-5, small  // Grip Strength Slope at Age = 80

 ( 1)  [cognition]grip9 - 5*[cognition]c.age85#c.grip9 = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0043262   .2473351     0.02   0.986    -.4815246     .490177
------------------------------------------------------------------------------

.       lincom c.grip9*1 + c.age85#c.grip9*0, small   // Grip Strength Slope at Age = 85

 ( 1)  [cognition]grip9 = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6194186   .1487424     4.16   0.000     .3272376    .9115996
------------------------------------------------------------------------------

.       lincom c.grip9*1 + c.age85#c.grip9*5, small   // Grip Strength Slope at Age = 90

 ( 1)  [cognition]grip9 + 5*[cognition]c.age85#c.grip9 = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.234511   .2554083     4.83   0.000     .7328017     1.73622
------------------------------------------------------------------------------

.       margins, at(c.age85=(-5(5)5)) dydx(c.grip9) df(543) vsquish // Grip Slope per Age

Average marginal effects                        Number of obs     =        550

Expression   : Linear prediction, fixed portion, predict()
dy/dx w.r.t. : grip9
1._at        : age85           =          -5
2._at        : age85           =           0
3._at        : age85           =           5

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
grip9        |
         _at |
          1  |   .0043262   .2473351     0.02   0.986    -.4815246     .490177
          2  |   .6194186   .1487424     4.16   0.000     .3272376    .9115996
          3  |   1.234511   .2554083     4.83   0.000     .7328017     1.73622
------------------------------------------------------------------------------

.       margins, at(c.age85=(-5(5)5) c.grip9=(-3(3)3) c.sexmw=0 c.demnf=0 c.demnc=0) vsquish,

Adjusted predictions                            Number of obs     =        550

Expression   : Linear prediction, fixed portion, predict()
1._at        : age85           =          -5
               grip9           =          -3
               sexmw           =           0
               demnf           =           0
               demnc           =           0
2._at        : age85           =          -5
               grip9           =           0
               sexmw           =           0
               demnf           =           0
               demnc           =           0
3._at        : age85           =          -5
               grip9           =           3
               sexmw           =           0
               demnf           =           0
               demnc           =           0
4._at        : age85           =           0
               grip9           =          -3
               sexmw           =           0
               demnf           =           0
               demnc           =           0
5._at        : age85           =           0
               grip9           =           0
               sexmw           =           0
               demnf           =           0
               demnc           =           0
6._at        : age85           =           0
               grip9           =           3
               sexmw           =           0
               demnf           =           0
               demnc           =           0
7._at        : age85           =           5
               grip9           =          -3
               sexmw           =           0
               demnf           =           0
               demnc           =           0
8._at        : age85           =           5
               grip9           =           0
               sexmw           =           0
               demnf           =           0
               demnc           =           0
9._at        : age85           =           5
               grip9           =           3
               sexmw           =           0
               demnf           =           0
               demnc           =           0

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   31.06463   1.260473    24.65   0.000     28.59415    33.53511
          2  |   31.07761   .9167886    33.90   0.000     29.28073    32.87448
          3  |   31.09058   1.092408    28.46   0.000     28.94951    33.23166
          4  |   27.54955   .9308775    29.60   0.000     25.72506    29.37403
          5  |    29.4078   .6949062    42.32   0.000     28.04581    30.76979
          6  |   31.26606   .7053323    44.33   0.000     29.88363    32.64848
          7  |   24.03447    1.14908    20.92   0.000     21.78231    26.28662
          8  |     27.738   .9217228    30.09   0.000     25.93146    29.54454
          9  |   31.44153   1.246179    25.23   0.000     28.99907      33.884
------------------------------------------------------------------------------

.       marginsplot, name(predicted_means, replace)       // Get and plot intercepts

  Variables that uniquely identify margins: age85 grip9

.           
. display as result "Eq 2.18: Adding Sex by Age by Grip Three-Way Interaction"
Eq 2.18: Adding Sex by Age by Grip Three-Way Interaction

. display as result "Age (0=85), Grip (0=9), Sex (0=Men), Dementia (0=None)"
Age (0=85), Grip (0=9), Sex (0=Men), Dementia (0=None)

. mixed cognition c.age85 c.grip9 c.sexmw c.demnf c.demnc ///
>                 c.age85#c.grip9 c.sexmw#c.demnf c.sexmw#c.demnc ///
>                 c.age85#c.sexmw c.grip9#c.sexmw c.age85#c.grip9#c.sexmw, /// 
>                   variance reml dfmethod(residual),

Computing degrees of freedom:

Mixed-effects REML regression                   Number of obs     =        550
DF method: Residual                             DF:           min =     538.00
                                                              avg =     538.00
                                                              max =     538.00

                                                F(11,   538.00)   =      21.22
Log restricted-likelihood = -1999.2019          Prob > F          =     0.0000

-----------------------------------------------------------------------------------------
              cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
                  age85 |   -.498287   .2062505    -2.42   0.016     -.903442   -.0931321
                  grip9 |    .739275   .2364183     3.13   0.002     .2748588    1.203691
                  sexmw |   -2.97349   1.036365    -2.87   0.004    -5.009308   -.9376712
                  demnf |  -6.165427   1.637934    -3.76   0.000    -9.382957   -2.947898
                  demnc |  -11.78371     2.2479    -5.24   0.000    -16.19945   -7.367977
                        |
        c.age85#c.grip9 |   .2299577   .0759486     3.03   0.003     .0807655    .3791499
                        |
        c.sexmw#c.demnf |   .3968833   2.079577     0.19   0.849    -3.688203     4.48197
                        |
        c.sexmw#c.demnc |  -8.145702   3.028321    -2.69   0.007    -14.09449   -2.196919
                        |
        c.age85#c.sexmw |   .0950725   .2741581     0.35   0.729     -.443479     .633624
                        |
        c.grip9#c.sexmw |  -.2000738   .3045673    -0.66   0.512    -.7983606     .398213
                        |
c.age85#c.grip9#c.sexmw |  -.1582701   .0953248    -1.66   0.097    -.3455246    .0289844
                        |
                  _cons |   28.95584   .7972432    36.32   0.000     27.38975    30.52193
-----------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
               var(Residual) |   85.94331   5.182576      76.36295     96.7256
------------------------------------------------------------------------------

. test (c.sexmw#c.demnf=0) (c.sexmw#c.demnc=0), small // change in R2 for Sex*DemGroup

 ( 1)  [cognition]c.sexmw#c.demnf = 0
 ( 2)  [cognition]c.sexmw#c.demnc = 0

       F(  2,538.00) =    3.78
            Prob > F =    0.0234

. test (c.age85#c.sexmw=0) (c.grip9#c.sexmw=0) ///
>      (c.age85#c.grip9#c.sexmw=0), small  // change in R2 for Age*Grip*Sex

 ( 1)  [cognition]c.age85#c.sexmw = 0
 ( 2)  [cognition]c.grip9#c.sexmw = 0
 ( 3)  [cognition]c.age85#c.grip9#c.sexmw = 0

       F(  3,538.00) =    1.06
            Prob > F =    0.3652

. 
. * Each MARGINS below does what the set of LINCOM statements above it do
. lincom c.age85*1 + c.age85#c.grip9*-3 + c.age85#c.sexmw*0  + c.age85#c.grip9#c.sexmw*0,  small // Age for 
> Grip=6 Men

 ( 1)  [cognition]age85 - 3*[cognition]c.age85#c.grip9 = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -1.18816   .3658565    -3.25   0.001    -1.906843   -.4694779
------------------------------------------------------------------------------

. lincom c.age85*1 + c.age85#c.grip9*0  + c.age85#c.sexmw*0  + c.age85#c.grip9#c.sexmw*0,  small // Age for 
> Grip=9 Men

 ( 1)  [cognition]age85 = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -.498287   .2062505    -2.42   0.016     -.903442   -.0931321
------------------------------------------------------------------------------

. lincom c.age85*1 + c.age85#c.grip9*3  + c.age85#c.sexmw*0  + c.age85#c.grip9#c.sexmw*0,  small // Age for 
> Grip=12 Men

 ( 1)  [cognition]age85 + 3*[cognition]c.age85#c.grip9 = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1915861   .2346381     0.82   0.415     -.269333    .6525052
------------------------------------------------------------------------------

. lincom c.age85*1 + c.age85#c.grip9*-3 + c.age85#c.sexmw*1  + c.age85#c.grip9#c.sexmw*-3, small // Age for 
> Grip=6 Wom

 ( 1)  [cognition]age85 - 3*[cognition]c.age85#c.grip9 + [cognition]c.age85#c.sexmw -
       3*[cognition]c.age85#c.grip9#c.sexmw = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.6182774   .1693681    -3.65   0.000    -.9509812   -.2855736
------------------------------------------------------------------------------

. lincom c.age85*1 + c.age85#c.grip9*0  + c.age85#c.sexmw*1  + c.age85#c.grip9#c.sexmw*0,  small // Age for 
> Grip=9 Wom

 ( 1)  [cognition]age85 + [cognition]c.age85#c.sexmw = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.4032146   .1806195    -2.23   0.026    -.7580204   -.0484087
------------------------------------------------------------------------------

. lincom c.age85*1 + c.age85#c.grip9*3  + c.age85#c.sexmw*1  + c.age85#c.grip9#c.sexmw*3,  small // Age for 
> Grip=12 Wom

 ( 1)  [cognition]age85 + 3*[cognition]c.age85#c.grip9 + [cognition]c.age85#c.sexmw +
       3*[cognition]c.age85#c.grip9#c.sexmw = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1881518   .3103169    -0.61   0.545     -.797733    .4214295
------------------------------------------------------------------------------

. margins, at(c.grip9=(-3(3)3) c.sexmw=(0(1)1)) dydx(c.age85) df(538) vsquish // Age Slope per Grip for Men,
>  Women

Average marginal effects                        Number of obs     =        550

Expression   : Linear prediction, fixed portion, predict()
dy/dx w.r.t. : age85
1._at        : grip9           =          -3
               sexmw           =           0
2._at        : grip9           =          -3
               sexmw           =           1
3._at        : grip9           =           0
               sexmw           =           0
4._at        : grip9           =           0
               sexmw           =           1
5._at        : grip9           =           3
               sexmw           =           0
6._at        : grip9           =           3
               sexmw           =           1

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
age85        |
         _at |
          1  |   -1.18816   .3658565    -3.25   0.001    -1.906843   -.4694779
          2  |  -.6182774   .1693681    -3.65   0.000    -.9509812   -.2855736
          3  |   -.498287   .2062505    -2.42   0.016     -.903442   -.0931321
          4  |  -.4032146   .1806195    -2.23   0.026    -.7580204   -.0484087
          5  |   .1915861   .2346381     0.82   0.415     -.269333    .6525052
          6  |  -.1881518   .3103169    -0.61   0.545     -.797733    .4214295
------------------------------------------------------------------------------

. 
. lincom c.grip9*1 + c.age85#c.grip9*-5 + c.grip9#c.sexmw*0  + c.age85#c.grip9#c.sexmw*0, small //Grip for A
> ge=80 for Men

 ( 1)  [cognition]grip9 - 5*[cognition]c.age85#c.grip9 = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.4105136   .4368221    -0.94   0.348      -1.2686    .4475723
------------------------------------------------------------------------------

. lincom c.grip9*1 + c.age85#c.grip9*0  + c.grip9#c.sexmw*0  + c.age85#c.grip9#c.sexmw*0, small //Grip for A
> ge=85 for Men

 ( 1)  [cognition]grip9 = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .739275   .2364183     3.13   0.002     .2748588    1.203691
------------------------------------------------------------------------------

. lincom c.grip9*1 + c.age85#c.grip9*5  + c.grip9#c.sexmw*0  + c.age85#c.grip9#c.sexmw*0, small //Grip for A
> ge=90 for Men

 ( 1)  [cognition]grip9 + 5*[cognition]c.age85#c.grip9 = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.889064   .4575844     4.13   0.000     .9901924    2.787935
------------------------------------------------------------------------------

. lincom c.grip9*1 + c.age85#c.grip9*-5 + c.grip9#c.sexmw*1  + c.age85#c.grip9#c.sexmw*-5,small //Grip for A
> ge=80 for Wom

 ( 1)  [cognition]grip9 - 5*[cognition]c.age85#c.grip9 + [cognition]c.grip9#c.sexmw -
       5*[cognition]c.age85#c.grip9#c.sexmw = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1807631   .3293737     0.55   0.583    -.4662531    .8277793
------------------------------------------------------------------------------

. lincom c.grip9*1 + c.age85#c.grip9*0  + c.grip9#c.sexmw*1  + c.age85#c.grip9#c.sexmw*0, small //Grip for A
> ge=85 for Wom

 ( 1)  [cognition]grip9 + [cognition]c.grip9#c.sexmw = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5392011   .1920093     2.81   0.005     .1620212     .916381
------------------------------------------------------------------------------

. lincom c.grip9*1 + c.age85#c.grip9*5  + c.grip9#c.sexmw*1  + c.age85#c.grip9#c.sexmw*5, small //Grip for A
> ge=90 for Wom

 ( 1)  [cognition]grip9 + 5*[cognition]c.age85#c.grip9 + [cognition]c.grip9#c.sexmw +
       5*[cognition]c.age85#c.grip9#c.sexmw = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8976392   .3621873     2.48   0.014     .1861646    1.609114
------------------------------------------------------------------------------

. margins, at(c.age85=(-5(5)5) c.sexmw=(0(1)1)) dydx(c.grip9) df(538) vsquish // Grip Slope per Age for Men,
>  Women

Average marginal effects                        Number of obs     =        550

Expression   : Linear prediction, fixed portion, predict()
dy/dx w.r.t. : grip9
1._at        : age85           =          -5
               sexmw           =           0
2._at        : age85           =          -5
               sexmw           =           1
3._at        : age85           =           0
               sexmw           =           0
4._at        : age85           =           0
               sexmw           =           1
5._at        : age85           =           5
               sexmw           =           0
6._at        : age85           =           5
               sexmw           =           1

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
grip9        |
         _at |
          1  |  -.4105136   .4368221    -0.94   0.348      -1.2686    .4475723
          2  |   .1807631   .3293737     0.55   0.583    -.4662531    .8277793
          3  |    .739275   .2364183     3.13   0.002     .2748588    1.203691
          4  |   .5392011   .1920093     2.81   0.005     .1620212     .916381
          5  |   1.889064   .4575844     4.13   0.000     .9901924    2.787935
          6  |   .8976392   .3621873     2.48   0.014     .1861646    1.609114
------------------------------------------------------------------------------

. 
. lincom c.sexmw*1 + c.age85#c.sexmw*-5 + c.grip9#c.sexmw*-3 + c.age85#c.grip9#c.sexmw*15, small //Sex for A
> ge=80 Grip=6

 ( 1)  [cognition]sexmw - 5*[cognition]c.age85#c.sexmw - 3*[cognition]c.grip9#c.sexmw +
       15*[cognition]c.age85#c.grip9#c.sexmw = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -5.222682   2.546191    -2.05   0.041    -10.22438   -.2209865
------------------------------------------------------------------------------

. lincom c.sexmw*1 + c.age85#c.sexmw*0  + c.grip9#c.sexmw*-3 + c.age85#c.grip9#c.sexmw*0,  small //Sex for A
> ge=85 Grip=6

 ( 1)  [cognition]sexmw - 3*[cognition]c.grip9#c.sexmw = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -2.373268   1.465705    -1.62   0.106    -5.252475    .5059388
------------------------------------------------------------------------------

. lincom c.sexmw*1 + c.age85#c.sexmw*5  + c.grip9#c.sexmw*-3 + c.age85#c.grip9#c.sexmw*-15,small //Sex for A
> ge=90 Grip=6

 ( 1)  [cognition]sexmw + 5*[cognition]c.age85#c.sexmw - 3*[cognition]c.grip9#c.sexmw -
       15*[cognition]c.age85#c.grip9#c.sexmw = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .4761458   2.437277     0.20   0.845      -4.3116    5.263892
------------------------------------------------------------------------------

. lincom c.sexmw*1 + c.age85#c.sexmw*-5 + c.grip9#c.sexmw*0  + c.age85#c.grip9#c.sexmw*0, small  //Sex for A
> ge=80 Grip=9

 ( 1)  [cognition]sexmw - 5*[cognition]c.age85#c.sexmw = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -3.448852   1.640431    -2.10   0.036    -6.671288   -.2264161
------------------------------------------------------------------------------

. lincom c.sexmw*1 + c.age85#c.sexmw*0  + c.grip9#c.sexmw*0  + c.age85#c.grip9#c.sexmw*0, small  //Sex for A
> ge=85 Grip=9

 ( 1)  [cognition]sexmw = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -2.97349   1.036365    -2.87   0.004    -5.009308   -.9376712
------------------------------------------------------------------------------

. lincom c.sexmw*1 + c.age85#c.sexmw*5  + c.grip9#c.sexmw*0  + c.age85#c.grip9#c.sexmw*0, small  //Sex for A
> ge=90 Grip=9

 ( 1)  [cognition]sexmw + 5*[cognition]c.age85#c.sexmw = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -2.498127   1.793104    -1.39   0.164    -6.020471    1.024216
------------------------------------------------------------------------------

. lincom c.sexmw*1 + c.age85#c.sexmw*-5 + c.grip9#c.sexmw*-3 + c.age85#c.grip9#c.sexmw*15,small  //Sex for A
> ge=80 Grip=12

 ( 1)  [cognition]sexmw - 5*[cognition]c.age85#c.sexmw - 3*[cognition]c.grip9#c.sexmw +
       15*[cognition]c.age85#c.grip9#c.sexmw = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -5.222682   2.546191    -2.05   0.041    -10.22438   -.2209865
------------------------------------------------------------------------------

. lincom c.sexmw*1 + c.age85#c.sexmw*0  + c.grip9#c.sexmw*0  + c.age85#c.grip9#c.sexmw*0, small  //Sex for A
> ge=85 Grip=12

 ( 1)  [cognition]sexmw = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -2.97349   1.036365    -2.87   0.004    -5.009308   -.9376712
------------------------------------------------------------------------------

. lincom c.sexmw*1 + c.age85#c.sexmw*5  + c.grip9#c.sexmw*3  + c.age85#c.grip9#c.sexmw*15,small  //Sex for A
> ge=90 Grip=12

 ( 1)  [cognition]sexmw + 5*[cognition]c.age85#c.sexmw + 3*[cognition]c.grip9#c.sexmw +
       15*[cognition]c.age85#c.grip9#c.sexmw = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    -5.4724   2.572987    -2.13   0.034    -10.52673   -.4180684
------------------------------------------------------------------------------

. margins, at(c.age85=(-5(5)5) c.grip9=(-3(3)3)) dydx(c.sexmw) df(538) vsquish // Sex Slope per Age and Grip

Average marginal effects                        Number of obs     =        550

Expression   : Linear prediction, fixed portion, predict()
dy/dx w.r.t. : sexmw
1._at        : age85           =          -5
               grip9           =          -3
2._at        : age85           =          -5
               grip9           =           0
3._at        : age85           =          -5
               grip9           =           3
4._at        : age85           =           0
               grip9           =          -3
5._at        : age85           =           0
               grip9           =           0
6._at        : age85           =           0
               grip9           =           3
7._at        : age85           =           5
               grip9           =          -3
8._at        : age85           =           5
               grip9           =           0
9._at        : age85           =           5
               grip9           =           3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
sexmw        |
         _at |
          1  |  -5.766063   2.516654    -2.29   0.022    -10.70974   -.8223899
          2  |  -3.992232   1.583296    -2.52   0.012    -7.102432   -.8820332
          3  |  -2.218402   2.016808    -1.10   0.272    -6.180185    1.743381
          4  |  -2.916649    1.40323    -2.08   0.038    -5.673131   -.1601665
          5  |   -3.51687   .9142939    -3.85   0.000    -5.312894   -1.720847
          6  |  -4.117092   1.171543    -3.51   0.000    -6.418451   -1.815732
          7  |  -.0672346   2.394032    -0.03   0.978    -4.770031    4.635562
          8  |  -3.041508   1.709729    -1.78   0.076    -6.400071    .3170555
          9  |  -6.015781   2.499018    -2.41   0.016    -10.92481   -1.106751
------------------------------------------------------------------------------

. 
. * MARGINS do not appear to work for simple two-way interactions below
. lincom c.age85#c.grip9*1  + c.age85#c.grip9#c.sexmw*0,  small      // Age by Grip for Men

 ( 1)  [cognition]c.age85#c.grip9 = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .2299577   .0759486     3.03   0.003     .0807655    .3791499
------------------------------------------------------------------------------

. lincom c.age85#c.grip9*1  + c.age85#c.grip9#c.sexmw*1,  small      // Age by Grip for Women

 ( 1)  [cognition]c.age85#c.grip9 + [cognition]c.age85#c.grip9#c.sexmw = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0716876   .0576075     1.24   0.214    -.0414757    .1848509
------------------------------------------------------------------------------

. lincom c.age85#c.sexmw*1  + c.age85#c.grip9#c.sexmw*-3, small      // Age by Sex for Grip=6

 ( 1)  [cognition]c.age85#c.sexmw - 3*[cognition]c.age85#c.grip9#c.sexmw = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5698828   .4031582     1.41   0.158    -.2220744     1.36184
------------------------------------------------------------------------------

. lincom c.age85#c.sexmw*1  + c.age85#c.grip9#c.sexmw*0,  small      // Age by Sex for Grip=9

 ( 1)  [cognition]c.age85#c.sexmw = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0950725   .2741581     0.35   0.729     -.443479     .633624
------------------------------------------------------------------------------

. lincom c.age85#c.sexmw*1  + c.age85#c.grip9#c.sexmw*3,  small      // Age by Sex for Grip=12

 ( 1)  [cognition]c.age85#c.sexmw + 3*[cognition]c.age85#c.grip9#c.sexmw = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.3797379   .3890393    -0.98   0.329     -1.14396    .3844845
------------------------------------------------------------------------------

. lincom c.sexmw#c.grip9*1  + c.age85#c.grip9#c.sexmw*-5, small      // Grip by Sex for Age=80

 ( 1)  [cognition]c.grip9#c.sexmw - 5*[cognition]c.age85#c.grip9#c.sexmw = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5912767   .5470837     1.08   0.280    -.4834053    1.665959
------------------------------------------------------------------------------

. lincom c.sexmw#c.grip9*1  + c.age85#c.grip9#c.sexmw*0,  small      // Grip by Sex for Age=85

 ( 1)  [cognition]c.grip9#c.sexmw = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2000738   .3045673    -0.66   0.512    -.7983606     .398213
------------------------------------------------------------------------------

. lincom c.sexmw#c.grip9*1  + c.age85#c.grip9#c.sexmw*5,  small      // Grip by Sex for Age=90

 ( 1)  [cognition]c.grip9#c.sexmw + 5*[cognition]c.age85#c.grip9#c.sexmw = 0

------------------------------------------------------------------------------
   cognition |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.9914244   .5835778    -1.70   0.090    -2.137795    .1549461
------------------------------------------------------------------------------

. * Get predicted means
. margins, at (c.age85=(-5(5)5) c.grip9=(-3(3)3) c.sexmw=(0(1)1) c.demnf=0 c.demnc=0) vsquish

Adjusted predictions                            Number of obs     =        550

Expression   : Linear prediction, fixed portion, predict()
1._at        : age85           =          -5
               grip9           =          -3
               sexmw           =           0
               demnf           =           0
               demnc           =           0
2._at        : age85           =          -5
               grip9           =          -3
               sexmw           =           1
               demnf           =           0
               demnc           =           0
3._at        : age85           =          -5
               grip9           =           0
               sexmw           =           0
               demnf           =           0
               demnc           =           0
4._at        : age85           =          -5
               grip9           =           0
               sexmw           =           1
               demnf           =           0
               demnc           =           0
5._at        : age85           =          -5
               grip9           =           3
               sexmw           =           0
               demnf           =           0
               demnc           =           0
6._at        : age85           =          -5
               grip9           =           3
               sexmw           =           1
               demnf           =           0
               demnc           =           0
7._at        : age85           =           0
               grip9           =          -3
               sexmw           =           0
               demnf           =           0
               demnc           =           0
8._at        : age85           =           0
               grip9           =          -3
               sexmw           =           1
               demnf           =           0
               demnc           =           0
9._at        : age85           =           0
               grip9           =           0
               sexmw           =           0
               demnf           =           0
               demnc           =           0
10._at       : age85           =           0
               grip9           =           0
               sexmw           =           1
               demnf           =           0
               demnc           =           0
11._at       : age85           =           0
               grip9           =           3
               sexmw           =           0
               demnf           =           0
               demnc           =           0
12._at       : age85           =           0
               grip9           =           3
               sexmw           =           1
               demnf           =           0
               demnc           =           0
13._at       : age85           =           5
               grip9           =          -3
               sexmw           =           0
               demnf           =           0
               demnc           =           0
14._at       : age85           =           5
               grip9           =          -3
               sexmw           =           1
               demnf           =           0
               demnc           =           0
15._at       : age85           =           5
               grip9           =           0
               sexmw           =           0
               demnf           =           0
               demnc           =           0
16._at       : age85           =           5
               grip9           =           0
               sexmw           =           1
               demnf           =           0
               demnc           =           0
17._at       : age85           =           5
               grip9           =           3
               sexmw           =           0
               demnf           =           0
               demnc           =           0
18._at       : age85           =           5
               grip9           =           3
               sexmw           =           1
               demnf           =           0
               demnc           =           0

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   32.67882   2.235223    14.62   0.000     28.29786    37.05978
          2  |   27.45614   1.219373    22.52   0.000     25.06621    29.84606
          3  |   31.44728   1.285491    24.46   0.000     28.92776    33.96679
          4  |   27.99843   1.019082    27.47   0.000     26.00106    29.99579
          5  |   30.21574   1.320378    22.88   0.000     27.62784    32.80363
          6  |   28.54072   1.594664    17.90   0.000     25.41523     31.6662
          7  |   26.73802   1.273557    20.99   0.000     24.24189    29.23414
          8  |   24.36475   .7254959    33.58   0.000      22.9428     25.7867
          9  |   28.95584   .7972432    36.32   0.000     27.39328    30.51841
         10  |   25.98235   .6621603    39.24   0.000     24.68454    27.28016
         11  |   31.17367    .809525    38.51   0.000     29.58703    32.76031
         12  |   27.59996   1.007067    27.41   0.000     25.62614    29.57377
         13  |   20.79722   2.222661     9.36   0.000     16.44088    25.15355
         14  |   21.27336   1.000048    21.27   0.000      19.3133    23.23342
         15  |   26.46441   1.321237    20.03   0.000     23.87483    29.05399
         16  |   23.96628   1.212252    19.77   0.000     21.59031    26.34225
         17  |    32.1316    1.52316    21.10   0.000     29.14626    35.11694
         18  |    26.6592   2.073703    12.86   0.000     22.59481    30.72358
------------------------------------------------------------------------------

. 
. * Close log
. log close STATA_Example2b
      name:  STATA_Example2b
       log:  C:\Dropbox\19_PSQF7375_Clustered\PSQF7375_Clustered_Example2\STATA_Example2b_Output.log
  log type:  text
 closed on:   1 Aug 2019, 14:58:51
------------------------------------------------------------------------------------------------------------
